app/controllers/graphs_controller.rb

SELECT "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @graph = Graph.find(params[:id])

INSERT INTO "graphs" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 12 Aug 2012 06:47:49 UTC +00:00], ["name", nil], ["updated_at", Sun, 12 Aug 2012 06:47:49 UTC +00:00]]
---
  def new
    @graph = Graph.new
    @graph.name=params[:name]
    @graph.users<<current_user