app/controllers/tasks_controller.rb

  def create_new_orphan_child
    @name=params[:name]
    @graph_id=params[:graph_id]
    @graph=Graph.find(@graph_id)
    @task=Task.new
    @task.name=@name
    @task.state="NOT_DONE"
    @task.save
---
SELECT "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT 1  [["id", "null"]]
INSERT INTO "tasks" ("created_at", "date", "description", "name", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 12 Aug 2012 08:56:06 UTC +00:00], ["date", nil], ["description", "NOT_DONE"], ["name", "TestTask"], ["state", nil], ["updated_at", Sun, 12 Aug 2012 08:56:06 UTC +00:00]]

  def change_status
    task_id=params[:task_id]
    stat=params[:status]
    @task=Task.find(task_id)
    @task.state=stat
    @task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tasks" SET "state" = 'DONE', "updated_at" = '2012-08-12 09:34:40.415902' WHERE "tasks"."id" = 2

  def link_task
    graph=params[:graph_id]
    task_parent=params[:task_parent]
    task_child=params[:task_child]
    @task1=Task.find(task_parent)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]